<?php


//HomeWork 13.
//Объявите переменную x и присвойте ей значение 5. Затем
//увеличьте значение x на 3 и выведите результат на экран
$x = 5;
print_r($x + 3);
//Объявите переменные a и b, присвойте им значения 10 и 7
//соответственно. Затем выведите на экран результат деления a на b
$a = 10;
$b = 7;
print_r($a / $b);
//Объявите переменные name и age и присвойте им значения "Алиса"
//и 25 соответственно. Затем выведите на экран фразу "Меня зовут
//Алиса, и мне 25 лет
$name = 'Алиса';
$age = 25;
print_r("Меня зовут $name, и мне $age лет");
//Объявите переменную y и присвойте ей значение 12. Затем
//увеличьте значение y в два раза и выведите результат на экран
$y = 12;
print_r($y * 2);
//Объявите переменные x и y и присвойте им значения 6 и 4
//соответственно. Затем выведите на экран результат умножения x на
//y
$x = 6;
$y = 4;
print_r($x * $y);
// Объявите две переменные и присвойте им значения чисел 7 и 3.
//Выполните операцию сложения с этими переменными и выведите
//результа
$first = 7;
$second = 3;
print_r($first + $second);

//Объявите переменную и присвойте ей строковое значение.
//Выполните операцию конкатенации этой строки со строкой "мне
//нравится программирование" и выведите результат

$vNew = "1245";
print_r("$vNew мне нравится программирование");

// Объявите переменную и присвойте ей значение числа. Затем
//выполните операцию инкремента на этой переменной и выведите
//результат

$vNum = 12345;
$vNum = ++$vNum;
print_r($vNum);

//Объявите две переменные и присвойте им значения строковых
//литералов. Выполните операцию конкатенации этих строк и
//выведите результат

$sOne = 'Какой то текст';
$sTwo = ' теперь склеен';
print_r($sOne . $sTwo);

//Объявите две переменные и присвойте им значение строковой
//цифры, а второй число. Выполните операцию сложения и выведите
//результат.

$Num1 = 'Строка';
$Num2 = 123;
print_r($Num1 + $Num2);
