<!--Объявите переменную x и присвойте ей значение 5. Затем увеличьте значение x на 3 и выведите результат на экран-->
<?php
$x = 5;
echo $x + 3;
?>
<!--Объявите переменные a и b, присвойте им значения 10 и 7 соответственно. Затем выведите на экран результат деления a на b.-->
<?php
$a = 10;
$b = 7;
echo $a / $b;
?>
<!--Объявите переменные name и age и присвойте им значения "Алиса" и 25 соответственно. Затем выведите на экран фразу "Меня зовут Алиса, и мне 25 лет".-->
<?php
$name = "Алиса";
$age = 25;
echo "Меня зовут $name, и мне $age лет.";
?>
<!--Объявите переменную y и присвойте ей значение 12. Затем увеличьте значение y в два раза и выведите результат на экран.-->
<?php
$y = 12;
$y *= 2;
echo $y;
?>
<!--Объявите переменные x и y и присвойте им значения 6 и 4 соответственно. Затем выведите на экран результат умножения x на y.-->
<?php
$x = 6;
$y = 4;
echo $x * $y;
?>
<!--Объявите две переменные и присвойте им значения чисел 7 и 3. Выполните операцию сложения с этими переменными и выведите результат.-->
<?php
$x = 7;
$y = 3;
echo $x + $y;
?>
<!--Объявите переменную и присвойте ей строковое значение. Выполните операцию конкатенации этой строки со строкой "мне нравится программирование" и выведите результат.-->
<?php
$str = "Я прохожу курс и ";
echo $str . "мне нравится программирование";
?>
<!--Объявите переменную и присвойте ей значение числа. Затем выполните операцию инкремента на этой переменной и выведите результат.-->
<?php
$num = 16;
echo ++$num;
?>
<!--Объявите две переменные и присвойте им значения строковых литералов. Выполните операцию конкатенации этих строк и выведите результат.-->
<?php
$str_1 = "Teach";
$str_2 = "MeSkills";
echo $str_1 . $str_2;
?>
<!--Объявите две переменные и присвойте им значение строковой цифры, а второй число. Выполните операцию сложения и выведите результат.-->
<?php
$str = "11";
$num = -10;
echo $str + $num;
?>